In [19]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [20]:
df = pd.read_csv('apply_demo.csv')
df.shape

(3989, 2)

In [21]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [22]:
#增加一列A
df['A'] = Series(['a']*3989)
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

In [23]:
df['A'] = df['A'].apply(str.upper) #让这一列大写
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [24]:
del df['A']
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [25]:
tmp = df['data'][0].strip().split(' ') 
tmp

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [26]:
def foo(line):
    line = line.strip().split(' ')
    return Series([line[1],line[3],line[5]])

In [27]:
df_temp = df['data'].apply(foo)

In [31]:
#更改colums的名字
df_temp = df_temp.rename(columns = {0:'Symbol',1:'Seqno',2:'price'})
df_temp.head()

  Symbol Seqno price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [32]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [34]:
df_temp.head()

  Symbol Seqno price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [35]:
#把上面的两个数据拼接起来
df_new  = df.combine_first(df_temp)
df_new.head()

  Seqno Symbol                                data price        time
0     0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1623  1473411962
1     0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1623  1473411962
2     0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1623  1473411963
3     0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1623  1473411963
4     1   APPL   Symbol: APPL Seqno: 1 Price: 1649  1649  1473411963